# Ex3 - Getting and Knowing your Dataexercises

### Step 1. Import the necessary libraries

In [2]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

In [3]:
address = "https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user"

### Step 3. Assign it to a variable called users and use the 'user_id' as index

In [20]:
url = address
users = pd.read_csv(url, sep = "|", index_col="user_id") ### index_col hace q la tabla empiece en 1 en vez de en 0.and
users                                             ### sep me dice como puedo separar las columnas y salen bien puestas en la tabla

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

### Step 4. See the first 25 entries

In [ ]:
user_id.iloc[:25,:]

In [7]:
user_id.loc[:25]

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

In [ ]:
user_id.head(25)

### Step 5. See the last 10 entries

In [39]:
users.tail(10)

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

### Step 6. What is the number of observations in the dataset?

In [21]:
users.age.size

943

In [16]:
x= user_id.tail(1).index.item()
x

943

943

### Step 7. What is the number of columns in the dataset?

In [9]:
user_id.count().count()

4

In [10]:
len(user_id.columns)

4

4

### Step 8. Print the name of all the columns.

In [22]:
users.columns

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

### Step 9. How is the dataset indexed?

In [23]:
users.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

In [46]:
# "the index" (aka "the labels")

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

### Step 10. What is the data type of each column?

In [13]:
user_id.sort_index().dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

### Step 11. Print only the occupation column

In [25]:
users.occupation

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

In [ ]:
users["occupation"]

user_id
1         technician
2              other
3             writer
4         technician
5              other
6          executive
7      administrator
8      administrator
9            student
10            lawyer
11             other
12             other
13          educator
14         scientist
15          educator
16     entertainment
17        programmer
18             other
19         librarian
20         homemaker
21            writer
22            writer
23            artist
24            artist
25          engineer
26          engineer
27         librarian
28            writer
29        programmer
30           student
           ...
914            other
915    entertainment
916         engineer
917          student
918        scientist
919            other
920           artist
921          student
922    administrator
923          student
924            other
925         salesman
926    entertainment
927       programmer
928          student
929        scientist
930        scientist
931         educator
932         educator
933          student
934         engineer
935           doctor
936            other
937         educator
938       technician
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

### Step 12. How many different occupations are in this dataset?

In [31]:
users.occupation.value_counts().count()

21

In [34]:
users.occupation.unique() ### te da el array de todas las profesiones que existen en la columna occupation

array(['technician', 'other', 'writer', 'executive', 'administrator',
       'student', 'lawyer', 'educator', 'scientist', 'entertainment',
       'programmer', 'librarian', 'homemaker', 'artist', 'engineer',
       'marketing', 'none', 'healthcare', 'retired', 'salesman', 'doctor'],
      dtype=object)

In [33]:
len(users.occupation.unique()) ### con la longitud len nos suma las que hay

21

In [30]:
users.occupation.describe() ## unique te dice cuantas

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

21

### Step 13. What is the most frequent occupation?

In [ ]:
users.occupation.mode()

In [ ]:
users.occupation.value_counts().sort_values(ascending=False).index[0]

In [ ]:
users_ = users.groupby("occupation").count()
users_

In [ ]:
users_[users_.age == users.occupation.value_counts().max()]

In [45]:
users[users.occupation == users.occupation.value_counts()[users.occupation.value_counts()==users.occupation.value_counts().max()].index[0]]  ### con una mÃ¡scara  sÃ³lo te recoge las de student

         age gender occupation zip_code
user_id
9         29      M    student    01002
30         7      M    student    55436
32        28      F    student    78741
33        23      M    student    27510
36        19      F    student    93117
...      ...    ...        ...      ...
928       21      M    student    55408
933       28      M    student    48105
939       26      F    student    33319
941       20      M    student    97229
943       22      M    student    77841

[196 rows x 4 columns]

In [37]:
users.occupation.mode()

0    student
dtype: object

In [ ]:
users.occupation.value_counts().idxmax()

In [40]:
users.occupation.value_counts().sort_values(ascending=False).index[0]

'student'

In [42]:
users.occupation.value_counts().index[0]

'student'

'student'

### Step 14. Summarize the DataFrame.

In [43]:
users.describe() ## solo lo hace con age porque es el Ãºnico que tiene nÃºmeros

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

In [76]:
user_id.describe()

       user_id|age|gender|occupation|zip_code
count                                     943
unique                                    943
top                  345|28|F|librarian|94143
freq                                        1

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

### Step 15. Summarize all the columns

In [52]:
users.describe(include="all")  ### te dice todas las columnas.

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

### Step 16. Summarize only the occupation column

In [53]:
users.occupation.describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

### Step 17. What is the mean age of users?

In [56]:
users.age.mean().round(0) ### el round da los decimales que quieres

34.0

34

### Step 18. What is the age with least occurrence?

In [60]:
users.age.value_counts().tail() ### esta bien porque coincide que hay sÃ³lo 5 sino no seria posible

11    1
10    1
73    1
66    1
7     1
Name: age, dtype: int64

In [63]:
users_age= users.groupby("age").count()   # groupby cambia el Ã­ndice. generamos un dataframe
users_age.gender.sort_values                # cogemos cualquier columna gender en este caso, utilizamos sort_values, nos da una serie con los elementos ordenados

<bound method Series.sort_values of age
7     1
10    1
11    1
13    5
14    3
     ..
66    1
68    2
69    2
70    3
73    1
Name: gender, Length: 61, dtype: int64>

In [ ]:
user.age.value_counts().tail().values[0]

In [65]:
### revisarlo en casa
users_age[users_age.gender == users.age.value_counts().tail(1).values[0]].index   ## con values lo transforma a array y puedo coger la posicion 0 pero tambiÃ©n puedo poner -1 ya q es el Ãºltimo valor. En tail es bueno poner 1 porque serÃ­a mÃ¡s eficiente.

Int64Index([7, 10, 11, 66, 73], dtype='int64', name='age')

In [66]:
users_age_f = users_age[users_age.gender == users.age.value_counts().tail(1).values[0]]
users_age_f

     gender  occupation  zip_code
age
7         1           1         1
10        1           1         1
11        1           1         1
66        1           1         1
73        1           1         1

In [67]:
users_age_f = users_age_f.drop(["gender", "occupation"] , axis=1)
users_age_f

     zip_code
age
7           1
10          1
11          1
66          1
73          1

In [ ]:
users_age_f = users_age_f.rename(columns={"zip_code":"frequencies"})
users_age_f

11    1
10    1
73    1
66    1
7     1
Name: age, dtype: int64